[
  {
    "version": "2.65.0",
    "date": "31th January, 2026",
    "changes": [
      "Now card shops show cheapest option for your selected language first.",
      "Added deck preview in deck list to quickly view deck contents without opening the deck.",
      "Added option to delete decks permanently. Normally deleted decks are kept for 60 days before being removed permanently.",
      "Fixed duplicate preconstructed decks from appearing in the Collection Tracker on slow connections.",
      "Minor bug fixes and performance improvements."
    ]
  },
  {
    "version": "2.64.0",
    "date": "23th January, 2026",
    "changes": [
      "Improved card collection add flow, showing which cards are already owned.",
      "Deck builder now preserves filters when closing crypt and library modals.",
      "Deck builder default sorting updated (crypt by capacity, library by name).",
      "Deck builder removed cards remain visible with a count of zero for easier re-adding.",
      "Improved card set tooltips on mobile with a unified display across the site.",
      "Added a delete deck button to the deck view for easier deck management.",
      "Preconstructed deck bulk add now supports multiple decks at once.",
      "Fixed filter reset to correctly restore taint selectors."
    ]
  },
  {
    "version": "2.63.0",
    "date": "16th January, 2026",
    "changes": [
      "Added a global search bar in the header for quick access to cards, decks, and users.",
      "Added advanced sorting for Crypt and Library cards in the Deck page and Deck Builder.",
      "Integrated eBay pricing from strategic vendors, completing price coverage across the card database.",
      "Navigation now preserves filters and scroll position when returning from deck pages.",
      "Fixed deck card filters not persisting after refresh or navigation.",
      "Fixed errors when accessing public profiles of non-existent users."
    ]
  },
  {
    "version": "2.62.0",
    "date": "10th January, 2026",
    "changes": [
      "Added initial French language support (may contain missing or inaccurate translations).",
      "Mobile deck list now preserves filters when navigating back.",
      "Added follower and following counts with direct links on user profiles.",
      "Usernames in comments now link to public profiles.",
      "Added Limited Format and Artist filters to Crypt and Library.",
      "Added support for custom profile image URLs (overrides Gravatar).",
      "Added 'Kickstarter Unleashed (2021)' as a separate set; existing collections were migrated automatically.",
      "Fixed some decks not appearing on public profile pages."
    ]
  },
  {
    "version": "2.61.0",
    "date": "5th January, 2026",
    "changes": [
      "Introduced a user follow system, allowing you to follow other users and receive notifications about their new decks and activity.",
      "Added a card change history section in the card modal to track significant updates over time.",
      "Improved card search by supporting AKA names in both Crypt and Library searches.",
      "Authentication now consistently sets essential cookies regardless of consent preferences, ensuring reliable login and session handling."
    ]
  },
  {
    "version": "2.60.0",
    "date": "1st January, 2026",
    "changes": [
      "Introduced a new Metagame Decks section highlighting popular deck archetypes in the current metagame.",
      "Added card price data from TCGMarket, with support for additional shops coming soon to expand price coverage.",
      "Added the HttB Reprint (2018) set to clearly differentiate it from HttB (2010). Existing collection cards have been migrated to HttBR (2018).",
      "Added the KoT Reprint (2018) set to clearly differentiate it from KoT (2008). Existing collection cards have been migrated to KoTR (2018).",
      "Added the Anthology I (2019) set to clearly differentiate it from Anthology (2017). Existing collection cards have been migrated to Anthology I (2019)."
    ]
  },
  {
    "version": "2.59.0",
    "date": "26th December, 2025",
    "changes": [
      "Added Sign in with Google for a faster and more seamless login and sign-up experience.",
      "Added Suggested Retail Price (MSRP) for preconstructed decks, replacing the aggregated price of individual cards.",
      "Added price tracking to the Collection Tracker, enabling quick access to individual card values.",
      "Added a new statistics section to the Collection Tracker, providing deeper insights into collection value and composition."
    ]
  },
  {
    "version": "2.58.0",
    "date": "19th December, 2025",
    "changes": [
      "Added all spoilers for the upcoming 'New Blood' set, including new cards and updated images.",
      "AI chat: Fixed request timeouts and improved response accuracy for better user experience. I'll be actively reviewing user questions and progressively improving the AI's answers so it better understands and applies VTES rules.",
      "Added card price information from CardGameGeek. Now you can see prices of almost all cards and decks.",
      "Note: More shops will be added soon for broader price coverage. Thanks Fabio(CardGameGeek) for providing the data!"
    ]
  },
  {
    "version": "2.57.0",
    "date": "10th December, 2025",
    "changes": [
      "Added holographic effect to card images in the card modal for a more immersive experience.",
      "Introduced warning messages on decks that include unreleased or banned cards, helping users quickly understand tournament legality.",
      "Launched NEW AI chat feature, allowing users to ask questions about VTES rules, card interactions, and rulings directly within the app.",
      "Reminder: For complex or specific interactions, even official rulings may require interpretation based on the current tournament environment. You should always ask an official VTES judge to confirm the ruling for competitive play."
    ]
  },
  {
    "version": "2.56.0",
    "date": "5th December, 2025",
    "changes": [
      "Introduced collapsible sections in card modals for cleaner and easier navigation.",
      "Added public user profile pages, showcasing each user's public decks and collections.",
      "Added card price information to both card modals and deck pages, including per-card prices and total deck cost. Prices are automatically shown in the user's currency.",
      "Note: Currently only Print-on-Demand shops are supported. More shops will be added soon for broader price coverage."
    ]
  },
  {
    "version": "2.55.0",
    "date": "28th November, 2025",
    "changes": [
      "Added proxy generator tool to create printable proxies for your decks.",
      "Improved card name searches by extending trigram similarity matching across more sections of the site.",
      "V5 and Two-Player Format tags are now shown as clickable buttons in the filter panel for faster deck filtering.",
      "Supporter users now display a special badge next to their name in comments and in the header.",
      "Added a text icon to quickly preview full card text on hover.",
      "Advent calendar is live! Check the homepage daily for new surprises throughout December 2025."
    ]
  },
  {
    "version": "2.54.0",
    "date": "19th November, 2025",
    "changes": [
      "Added card filters to the URL, allowing you to share specific searches.",
      "Added a share button to Crypt and Library pages to easily share individual cards.",
      "Added localized card text in the card modal when no localized image is available. Note: card texts are not available for all cards due to outdated data in the official CSV.",
      "Fixed and updated all Print-on-Demand shop links and prices. They should now refresh correctly every day."
    ]
  },
  {
    "version": "2.53.0",
    "date": "7th November, 2025",
    "changes": [
      "Added new Grid layout for Crypt and Library cards.",
      "Improved card browsing with a cleaner and more visual interface.",
      "Enhanced image loading with lazy loading — only visible images load for faster performance.",
      "Updated TRUE Brujah PoD images with correct text."
    ]
  },
  {
    "version": "2.52.0",
    "date": "30th October, 2025",
    "changes": [
      "Migrated all images to a CDN cache to boost loading speed and overall performance.",
      "Enhanced card name search with trigram similarity for more accurate results, even with typos or partial matches.",
      "Added a special Halloween theme and effects for the spooky season."
    ]
  },
  {
    "version": "2.51.0",
    "date": "20th October, 2025",
    "changes": [
      "Add new Sabbat V5 (SV5) set cards.",
      "Add new Sabbat V5 (SV5) to Preconstructed Decks.",
      "Added Path filter to Deck, Crypt and Library sections.",
      "Add Path icon to Deck, Crypt and Library cards.",
      "Updated clan naming and icons: Assamite → Banu Haqim, Follower of Set → Ministry. Filters and search now use V5 naming conventions.",
      "Fixed an issue that caused duplicate decks to appear when scrolling on slow network connections."
    ]
  },
  {
    "version": "2.50.0",
    "date": "25th August, 2025",
    "changes": [
      "New tags: Added #v5 and #2player for limited format decks, making them easier to find.",
      "Added Strike (taint) for both Crypt and Library cards.",
      "V5H (V5 Hecata) and V5L (V5 Lasombra) are now separated sets from the regular V5 set.",
      "Collection Tracker: Added filters by Type, Clan, and Discipline.",
      "Collection Tracker: Now supports Print-on-Demand (POD) sets.",
      "Tip: Use the Collection Tracker to easily organize and monitor your cards."
    ]
  },
  {
    "version": "2.49.0",
    "date": "15th August, 2025",
    "changes": [
      "Added a new deck filter by percentage of collection completion.",
      "You can now import cards from preconstructed decks directly into your collection.",
      "New set added: Full Art Promo.",
      "New set added: BCP Business Cards."
    ]
  },
  {
    "version": "2.48.0",
    "date": "3rd August, 2025",
    "changes": [
      "Introduced Collection Tracker: manage your personal card collection directly on the site.",
      "Add cards to your collection with detailed info: Set, Binder, Condition, Language, and personal Notes.",
      "View and filter your collection with flexible search and organization options.",
      "Binders can now be created and shared with others.",
      "In Deck view, see how many cards you own from your collection and whether you have enough to build the deck."
    ]
  },
  {
    "version": "2.47.0",
    "date": "4th July, 2025",
    "changes": [
      "Added Flight filter to both Crypt and Library sections.",
      "Added Set filter to Crypt and Library sections.",
      "Added set images in Crypt and Library modals."
    ]
  },
  {
    "version": "2.46.0",
    "date": "27th June, 2025",
    "changes": [
      "Added card text search filter to both Crypt and Library sections.",
      "Introduced support for regular expressions in card name and text search using the /your-regex/ syntax.",
      "Switched primary funding platform from Ko-fi to Patreon.",
      "Enabled YouTube video embedding in markdown descriptions and comments."
    ]
  },
  {
    "version": "2.45.0",
    "date": "21st June, 2025",
    "changes": [
      "Added Similar Decks section to deck detail page for easier exploration of related builds."
    ]
  },
  {
    "version": "2.44.0",
    "date": "20th June, 2025",
    "changes": [
      "Added detailed card info in Crypt and Library sections: number of copies in 'Where can I find it?', decks including the card in 'My Decks,' and copy counts in filtered decks.",
      "Added an Edit link in the Rulings section",
      "Enabled horizontal scroll on  desktop for filters in Decks, Crypt, and Library",
      "Add limited format filter in Decks"
    ]
  },
  {
    "version": "2.43.0",
    "date": "14th June, 2025",
    "changes": [
      "Added Markdown support for cards, clans, and disciplines",
      "Added V5 Predefined Limited Format",
      "Fixed issue causing duplicate decks to be created",
      "Fixed card popovers in the deck builder for mobile devices"
    ]
  },
  {
    "version": "2.42.0",
    "date": "07th June, 2025",
    "changes": [
      "Add Markdown support for deck descriptions",
      "Add Markdown support for comments"
    ]
  },
  {
    "version": "2.41.0",
    "date": "30th May, 2025",
    "changes": [
      "Add New Blood: Hecata",
      "Add New Blood: Lasombra",
      "Add price information to Print on Demand shops"
    ]
  },
  {
    "version": "2.40.0",
    "date": "17th May, 2025",
    "changes": [
      "New Feature: Limited Format Decks",
      "Add Two Player Limited Format",
      "Other minor fixes"
    ]
  },
  {
    "version": "2.39.0",
    "date": "10th May, 2025",
    "changes": [
      "Improve deck layout and styles"
    ]
  },
  {
    "version": "2.38.0",
    "date": "9th May, 2025",
    "changes": [
      "Refactor layout and styles for improved responsiveness and aesthetics"
    ]
  },
  {
    "version": "2.37.0",
    "date": "3rd March, 2025",
    "changes": [
      "Add more deck export options"
    ]
  },
  {
    "version": "2.36.0",
    "date": "2nd March, 2025",
    "changes": [
      "Add Relevance order to Crypt & Library in Deck Builder"
    ]
  },
  {
    "version": "2.35.0",
    "date": "26th April, 2025",
    "changes": [
      "Add Proxy Print tool",
      "Add Proxy Images to set tooltip"
    ]
  },
  {
    "version": "2.34.1",
    "date": "18th April, 2025",
    "changes": [
      "Fix Crypt & Library draw probability"
    ]
  },
  {
    "version": "2.34.0",
    "date": "18th April, 2025",
    "changes": [
      "Add VTES AI Chat (currently in beta testing)"
    ]
  },
  {
    "version": "2.33.0",
    "date": "15th April, 2025",
    "changes": [
      "Unify Export Deck in a dropdown menu",
      "Add Export Deck in Deck Builder",
      "Add Clone Deck in Deck Builder",
      "Add Draw Cards tool",
      "Add app version to footer"
    ]
  },
  {
    "version": "2.32.0",
    "date": "14th April, 2025",
    "changes": [
      "Angular 19 Update"
    ]
  },
  {
    "version": "2.31.0",
    "date": "14th April, 2025",
    "changes": [
      "Deprecated @akita library dependency",
      "The deck builder history functionality has been removed because it was implemented by the @akita library which is no longer maintained"
    ]
  },
  {
    "version": "2.30.0",
    "date": "28th February, 2025",
    "changes": [
      "Add option to restore deleted user decks"
    ]
  },
  {
    "version": "2.29.0",
    "date": "26th February, 2025",
    "changes": [
      "Add Hecata clan",
      "Add Fifth Edition: Hecata"
    ]
  },
  {
    "version": "2.28.1",
    "date": "24th January, 2025",
    "changes": [
      "Fix draw probability issue",
      "Fix TypeError"
    ]
  },
  {
    "version": "2.28.0",
    "date": "22nd January, 2025",
    "changes": [
      "Fix service unavailable error due to cache",
      "Improve error handling"
    ]
  },
  {
    "version": "2.27.0",
    "date": "8th January, 2025",
    "changes": [
      "Update framework to Angular 18.2.13"
    ]
  },
  {
    "version": "2.26.0",
    "date": "12th October, 2024",
    "changes": [
      "Add statistics section"
    ]
  },
  {
    "version": "2.25.0",
    "date": "28th September, 2024",
    "changes": [
      "Add Oblivion discipline",
      "Add Fifth Edition: Lasombra",
      "Add search card by aka name"
    ]
  },
  {
    "version": "2.24.0",
    "date": "28th September, 2024",
    "changes": [
      "Add Portuguese localization"
    ],
    "showDialog": false
  },
  {
    "version": "2.22.0",
    "date": "15th September, 2024",
    "changes": [
      "Add Spanish localization"
    ],
    "showDialog": false
  },
  {
    "version": "2.21.0",
    "date": "20th July, 2024",
    "changes": [
      "Add 30th Anniversary cards"
    ],
    "showDialog": false
  },
  {
    "version": "2.20.0",
    "date": "8th June, 2024",
    "changes": [
      "Add notifications when someone comment on your decks"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.5",
    "date": "13th March, 2024",
    "changes": [
      "Fix name change detection filter on deck builder"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.4",
    "date": "23rd February, 2024",
    "changes": [
      "Add library discipline/clan/title/sect not required filter"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.3",
    "date": "21st February, 2024",
    "changes": [
      "Fix user update display name"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.2",
    "date": "17th February, 2024",
    "changes": [
      "Fix dark mode styles",
      "Fix typo errors"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.1",
    "date": "9th February, 2024",
    "changes": [
      "Fix reset password on mobile device"
    ],
    "showDialog": false
  },
  {
    "version": "2.19.0",
    "date": "8th February, 2024",
    "changes": [
      "Add Forgot Password functionality",
      "Fix Show of Force image"
    ],
    "showDialog": true
  },
  {
    "version": "2.18.1",
    "date": "7th February, 2024",
    "changes": [
      "Add Promo Tegyrius, Vizier"
    ],
    "showDialog": true
  },
  {
    "version": "2.18.0",
    "date": "4th February, 2024",
    "changes": [
      "Redesign MyDecks with advanced filters",
      "Redesign Bookmarks with advanced filters",
      "Fix error when enter crypt&library section by first time",
      "Improve deck pagination on scroll"
    ],
    "showDialog": true
  },
  {
    "version": "2.17.0",
    "date": "2nd February, 2024",
    "changes": [
      "New way to filter decks with tags based on deck content",
      "Add badge to banned cards"
    ],
    "showDialog": true
  },
  {
    "version": "2.16.0",
    "date": "29th January, 2024",
    "changes": [
      "Add Gamepod as Print of Demand shop"
    ],
    "showDialog": true
  },
  {
    "version": "2.15.0",
    "date": "27th January, 2024",
    "changes": [
      "New Dark Mode Theme: Experience our website in a sleek and eye-friendly dark color scheme.",
      "Add Table Seating Tool"
    ],
    "showDialog": true
  },
  {
    "version": "2.14.1",
    "date": "7th January, 2024",
    "changes": [
      "Fix error that allows publish empty decks",
      "Fix missing icons on decks page"
    ],
    "showDialog": false
  },
  {
    "version": "2.14.0",
    "date": "5th January, 2024",
    "changes": [
      "Add new cards of V5 (Ravnos, Tzimisce & Salubri)",
      "Refactor all web icons",
      "Fix Thaumaturgy discipline icons to be Blood Sorcery",
      "Update Emerald Legionnaire & Ashur Tablets image with ERRATA"
    ],
    "showDialog": true
  },
  {
    "version": "2.13.0",
    "date": "31st December, 2023",
    "changes": [
      "Add errata to decks with cards that have changed their text that can affect the viability of the deck. (Preparing for the upcoming changes in Ashur/Legionnaire)"
    ],
    "showDialog": true
  },
  {
    "version": "2.12.0",
    "date": "10th November, 2023",
    "changes": [
      "Add swipe navigation on Crypt&Library section for mobile devices",
      "Add list of decks containing card on Crypt&Library section"
    ],
    "showDialog": true
  },
  {
    "version": "2.11.0",
    "date": "20th October, 2023",
    "changes": [
      "New deck filter: absolute library cards ratio",
      "Allow custom input for library cards ratio"
    ],
    "showDialog": true
  },
  {
    "version": "2.10.0",
    "date": "13th October, 2023",
    "changes": [
      "Allow navigate with keyboard arrow on Crypt & Library section",
      "Dismiss Crypt & Library card modal on back button click",
      "Add result count on Crypt & Library section"
    ],
    "showDialog": true
  },
  {
    "version": "2.9.0",
    "date": "7th October, 2023",
    "changes": [
      "Add New Blood 2 Preconstructed Decks",
      "Add Open in builder from Deck"
    ],
    "showDialog": true
  },
  {
    "version": "2.8.0",
    "date": "16th September, 2023",
    "changes": [
      "Add New Blood 2"
    ],
    "showDialog": true
  },
  {
    "version": "2.8.0",
    "date": "11th August, 2023",
    "changes": [
      "Add Print on Demand filter on Crypt & Library sections",
      "Add link to DriveThruCards on Crypt & Library detail"
    ],
    "showDialog": true
  },
  {
    "version": "2.7.2",
    "date": "6th August, 2023",
    "changes": [
      "Minor fix on deck descriptions"
    ],
    "showDialog": false
  },
  {
    "version": "2.7.1",
    "date": "2nd August, 2023",
    "changes": [
      "Fix library section type filter for multi-type cards.",
      "Fix deck builder library filter for multi-type cards."
    ],
    "showDialog": false
  },
  {
    "version": "2.7.0",
    "date": "29th July, 2023",
    "changes": [
      "Update card with Shadows of Berlin and Echoes of Gehenna changes.",
      "Add Crypt & Library detail modal on deck view.",
      "Add Preconstructed decks section."
    ],
    "showDialog": true
  },
  {
    "version": "2.6.0",
    "date": "21st April, 2023",
    "changes": [
      "Fix a bug where the Tools menu was not rendering correctly on certain pages.",
      "Enhanced user experience by optimizing the storage of crypt and library data for quicker access."
    ],
    "showDialog": true
  },
  {
    "version": "2.5.6",
    "date": "26th March, 2023",
    "changes": [
      "Improve homepage links for mobile devices"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.5",
    "date": "18th March, 2023",
    "changes": [
      "Update card text",
      "Update card images",
      "Fix discipline icons on card rulings text"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.4",
    "date": "17th March, 2023",
    "changes": [
      "Added button to navigate between cards on crypt/library detail modal"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.3",
    "date": "10th March, 2023",
    "changes": [
      "Sort option that is active will now be highlighted",
      "Add Crypt & Library Sets detail"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.2",
    "date": "6th March, 2023",
    "changes": [
      "Add new sorting criteria for crypt&deck cards based on popularity"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.1",
    "date": "5th March, 2023",
    "changes": [
      "Add Crypt & Library detail with rulings"
    ],
    "showDialog": true
  },
  {
    "version": "2.5.0",
    "date": "4th March, 2023",
    "changes": [
      "Add Crypt section to view all crypt cards with filters",
      "Add Library section to view all library cards with filters"
    ],
    "showDialog": true
  },
  {
    "version": "2.4.0",
    "date": "1st March, 2023",
    "changes": [
      "New minigame VTESDLE based on WORDLE popular game"
    ],
    "showDialog": true
  },
  {
    "version": "2.3.3",
    "date": "25th February, 2023",
    "changes": [
      "Improved deck builder filter by name when search for cards with accents and special characters",
      "Now login's 'Remember me' is checked by default",
      "Fixed interaction with header links for mobile"
    ],
    "showDialog": true
  },
  {
    "version": "2.3.2",
    "date": "13th February, 2023",
    "changes": [
      "Change the group filter in the deck builder to be smarter. Now takes into account the vampires you already have for the initial adjustment"
    ],
    "showDialog": true
  },
  {
    "version": "2.3.1",
    "date": "3rd February, 2023",
    "changes": [
      "Change home layout to show first the popular decks. This was done to improve how popular decks are sorted, since showing new ones first tended to always be popular ones",
      "Disallow rating on own decks",
      "Fix problem in deck filter when it was filtered by cards removed from the deck"
    ],
    "showDialog": true
  },
  {
    "version": "2.3.0",
    "date": "28th January, 2023",
    "changes": [
      "Update framework to Angular 15.1"
    ],
    "showDialog": true
  },
  {
    "version": "2.2.0",
    "date": "28th December, 2022",
    "changes": [
      "Added Progressive Web App configuration, now website can be installed as Android/IOS app with prefetch data"
    ],
    "showDialog": true
  },
  {
    "version": "2.1.0",
    "date": "22nd October, 2022",
    "changes": [
      "Add new Fall of London set"
    ],
    "showDialog": true
  },
  {
    "version": "2.0.1",
    "date": "21st October, 2022",
    "changes": [
      "Add promo card: Maila"
    ],
    "showDialog": true
  },
  {
    "version": "2.0.0",
    "date": "3rd September, 2022",
    "changes": [
      "We have rebuilt the app on a new framework and modernized its design",
      "<strong>Modern Frontend</strong> used: Angular 14.1 with Bootstrap 5.2",
      "Improved <strong>Deck Builder Tool</strong> with tons of new filters and utilities",
      "Improved <strong>Deck Card</strong>, more simple and clean",
      "Improved <strong>Decks Filters</strong>, more responsive and easy to use",
      "New option to save your <strong>private decks</strong>",
      "<strong>Changelog</strong> page"
    ],
    "showDialog": true
  },
  {
    "version": "1.0.0",
    "date": "31st August, 2020",
    "changes": [
      "Initial Released"
    ],
    "showDialog": true
  }
]